[
  {
    "title": "Principal Software Engineer",
    "employer": "Varo, UT",
    "period": "2019-present",
    "description": "Building full-stack application using ReactJS, React Context, React Hooks, Apollo client, ES6, enzyme, material-ui, typescript, graphql, micro-services using Apollo Server, jest, Kafka, GRPC, elastic search, redis cache. Bootstrap and architect projects and guide how to setup CI/CD. Mentor junior engineers. Integration with okta for authentication. Implement access control both in front end as well as backend(Graphql) using CASL library. Participating in Front End and Graphql architecture meetings. Integrate GraphQL servers with backend GRPC services. Building search infrastructure using elastic search"
  },
  {
    "title": "Sr. Software Engineer",
    "employer": "SoFi, UT",
    "period": "2018-2019",
    "description": "Building front end applications using ReactJS, React Context, React Hooks, Redux, Thunk, GraphQL (apollo client), ES6, Babel, Saga, jest, enzyme, reselect, formik, material-ui, typescript. Other than working on the main dashboard (main project), took initiative to build internal tools (full-stack application) for dataware house team to visualize data. Take part in demo. Collaborate with devops to get Bamboo setup for UI projects. Took initiative to build bridge library for mobile team so that communication between web and mobile follows a standard agreed contract while using WebView. UI code bundle analysis for investigating dependencies causing large bundle size"
  },
  {
    "title": "Sr. Software Engineer",
    "employer": "SpheraSolutions, UT",
    "period": "2016-2018",
    "description": "Building front end application using ReactJS, Redux, Saga, NodeJS, Webpack, SASS, jsPDF, XLSjs, PostCSS, ES6, Babel and all other good things in Front End. Helping team to migrate a legacy application consisting of 150+ screens. This development was a very large scale FE development. It started with initial demo to leadership to agree on new tech for FE and then leading the effort of putting together the base architecture that all other developers later contributed to. The entire process consisted of build base arch, then demoing multiple times and working with out UI/UX developer"
  },
  {
    "title": "Sr. Software Engineer",
    "employer": "IHS, UT",
    "period": "2013-2016",
    "description": "Full-stack application development using jQuery, JSF/Primefaces, Weblogic, Maven, Java/JEE, Spring. Worked as expert advisor for JSF/Primefaces and jQuery. Converted manual deployment process to Jenkins CI"
  },
  {
    "title": "Associate Programmer",
    "employer": "LiquidHub, PA",
    "period": "2012-2013",
    "description": "Full-stack application development using jQuery, JSF/Facelets, Jersey API, Spring, Drools, Java/JEE. Converted manual test cases to automated system using Selenium and Jenkins"
  },
  {
    "title": "Computer Programmer/Analyst",
    "employer": "SourceInfotech, NJ",
    "period": "2008-2011",
    "description": "Building full-stack application using Applet, JSF, JSP, Servlets, WAS, RAD, VB, Checkstyle, Javascript. JSF custom components development dealing with internal lifecycle of JSF framework. Developing REST based services"
  },
  {
    "title": "Software Engineer",
    "employer": "White Technologies Group, India",
    "period": "2006-2008",
    "description": "Desktop application development using Java Swing  and JEE middleware. Technologies used were Swing, EJB, Weblogic, Checkstyle, JUnit, XDocklet"
  },
  {
    "title": "Software Engineer",
    "employer": "CashEdge(Now Fiserv), India",
    "period": "2005-2006",
    "description": "Production support & enhancement in financial/banking application. Had to deal with different technologies like JSP, EJB, Oracle, Weblogic, Ant, SSO, Servlet, Jaavascript, JSTL, Strust, SAX, DOm, SVN, Checkstyle, SQL. Optimizing SQL performance"
  },
  {
    "title": "Software Engineer",
    "employer": "CSC, India",
    "period": "2004-2005",
    "description": "End to end JEE based application development for healthcare sector using technologies like IBM Porlet, EJB, XML, XSLT, DB2 WAS, WPS, WADS, MQseris, Ant, Checkstyle, Rational XDE, Unit, XML Spy. Taking lead on describing how to do TDD based development. Developing POC & creating report on performance comparison of XML/XSLT Vs JSF based page rendering. Collaboration with architects in design decisions/suggestions"
  }
]
